{"identifier": "0ea2deb820de428a82176c6acd2575b5",
"timestamp": 1748215924.160738,
"name": "Grilled Chicken Skewers With Tarragon and Yogurt",
"note": "These grilled chicken skewers are gently spiced with a ginger-and-cumin yogurt marinade, which makes the meat exceedingly tender and cooks to fragrant curds. As they grill, the skewers are gilded with a tarragon-mint baste that tastes distinctly Persian. Restraint and a very hot grill are both key to getting a good char: Don’t move the skewers until the yogurt is burnished and the meat releases from the grates. Color is flavor. Catch any juices that run out of the cooked skewers with warm pita bread. Leftovers make excellent chicken salad.",
"sourceName": "cooking.nytimes.com",
"sourceUrl": "https://cooking.nytimes.com/recipes/1021082-grilled-chicken-skewers-with-tarragon-and-yogurt#notes_section",
"ingredients": [
  {
    "rawIngredient": "2 1/2 pounds boneless, skinless chicken thighs",
    "name": "boneless, skinless chicken thighs",
    "quantity": "2 1/2 pounds",
    "note": ""
  },
  {
    "rawIngredient": "2 teaspoons kosher salt",
    "name": "kosher salt",
    "quantity": "2 teaspoons",
    "note": ""
  },
  {
    "rawIngredient": "8 scallions, trimmed",
    "name": "scallions, trimmed",
    "quantity": "8",
    "note": ""
  },
  {
    "rawIngredient": "6 pita breads",
    "name": "pita breads",
    "quantity": "6",
    "note": ""
  },
  {
    "rawIngredient": "2 1/2 cups full-fat Greek yogurt",
    "name": "full-fat Greek yogurt",
    "quantity": "2 1/2 cups",
    "note": ""
  },
  {
    "rawIngredient": "1/4 cup fresh lime juice (from 2 limes)",
    "name": "fresh lime juice (from 2 limes)",
    "quantity": "1/4 cup",
    "note": ""
  },
  {
    "rawIngredient": "1 tablespoon extra-virgin olive oil",
    "name": "extra-virgin olive oil",
    "quantity": "1 tablespoon",
    "note": ""
  },
  {
    "rawIngredient": "2 1/2 teaspoons kosher salt",
    "name": "kosher salt",
    "quantity": "2 1/2 teaspoons",
    "note": ""
  },
  {
    "rawIngredient": "1 garlic clove, crushed",
    "name": "garlic clove",
    "quantity": "1",
    "note": "crushed"
  },
  {
    "rawIngredient": "1 (2-inch) piece fresh ginger, peeled and finely grated",
    "name": "fresh ginger",
    "quantity": "1 (2-inch) piece",
    "note": "peeled and finely grated"
  },
  {
    "rawIngredient": "2 teaspoons roasted cumin seeds, bruised using a mortar and pestle",
    "name": "roasted cumin seeds, bruised using a mortar and pestle",
    "quantity": "2 teaspoons",
    "note": ""
  },
  {
    "rawIngredient": "1/4 cup unsalted butter (1/2 stick)",
    "name": "unsalted butter (1/2 stick)",
    "quantity": "1/4 cup",
    "note": ""
  },
  {
    "rawIngredient": "1/4 teaspoon kosher salt",
    "name": "kosher salt",
    "quantity": "1/4 teaspoon",
    "note": ""
  },
  {
    "rawIngredient": "2 tablespoons fresh lime juice (from 1 lime), plus 4 lime wedges for serving",
    "name": "fresh lime juice (from 1 lime), plus 4 lime wedges for serving",
    "quantity": "2 tablespoons",
    "note": ""
  },
  {
    "rawIngredient": "1/4 cup chopped fresh tarragon, mint or both, plus more torn herbs for serving",
    "name": "chopped fresh tarragon, mint or both, plus more torn herbs for serving",
    "quantity": "1/4 cup",
    "note": ""
  }
],
"preparationSteps": [
  "Prepare the chicken: Cut each thigh in half against the grain. Rub with salt and set aside.",
  "Prepare the marinade: In a small bowl, mix the yogurt, lime juice, olive oil, salt and garlic. Reserve and refrigerate 1 cup marinade for serving. Put remaining marinade into a large resealable plastic bag and add the ginger, cumin and chicken; squelch around to coat thoroughly then refrigerate for 1 hour, or up to 48 hours.",
  "Remove the chicken from the refrigerator 1 hour before you plan to grill. If using wooden skewers, immerse them in water to soak for 15 minutes. Alternatively, use metal skewers or none at all.",
  "Prepare the grill: Clean the grate thoroughly and build a hot fire. The skewers will cook over intense, direct heat. The coals are ready when they glow red and the grate hisses when you drop water on it.",
  "Thread the chicken lengthwise onto skewers (if using), then smear with the marinade from the bag.",
  "Prepare the baste: Place the butter and salt in a small saucepan to melt on the cooler side of the grill (or use the stovetop). Once butter is melted, add the lime juice and chopped herbs; keep warm but do not boil.",
  "Grilling in batches if necessary, place the chicken on the grill a few inches apart. When you see a good char forming underneath, about 3 to 5 minutes, gently tug a skewer or the chicken: If it feels very stuck, leave it a few more minutes before turning. When the chicken releases easily and looks nicely charred in places, flip it using a fish spatula to gently pry any stuck bits off the grate.",
  "Baste the chicken with the herb butter and arrange the scallions in a single layer on the cooler edges of the grill. Let the chicken cook on the second side until firm and cooked through and turn the scallions occasionally until grill-marked and tender, about 8 minutes.",
  "Grill the pitas until marked, about 1 minute, turning halfway through. Lay them on the serving platter and place the scallions and chicken on top. Drizzle the bread, scallions and chicken with any remaining warm herb butter. Dollop chicken with reserved marinade, squeeze with lime and top with extra tarragon or mint."
],
"photoIds": [
  "ee11d7cc265c4c45be5a0179fd27c5b5"
],
"photoUrls": [],
"adCampaignId": null,
"scaleFactor": null,
"rating": null,
"creationTimestamp": 1748215924.130914,
"nutritionalInfo": "Calories: 563\nFat: 25 grams\nSaturated Fat: 11 grams\nUnsaturated Fat: 10 grams\nTrans Fat: 0 grams\nSodium: 957 milligrams\nCarbohydrates: 35 grams\nFiber: 4 grams\nSugar: 6 grams\nProtein: 51 grams",
"cookTime": null,
"prepTime": null,
"servings": "4 to 6 servings",
"paprikaIdentifier": null,
"protobuf": {},
"recipeDataId": null
}